In [ ]:
# given a pandas dataframe df with columns 'A','B','C',write a python function to re-index the dataframe with new index that starts from 1 and increments by 2 for each row.

In [1]:
import pandas as pd

In [3]:
data = {"A":[1,2,3,4],
        "B":[4,5,6,7],
        "C":["kiwi","vinivici","toto","alex"]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   A  B         C
0  1  4      kiwi
1  2  5  vinivici
2  3  6      toto
3  4  7      alex

In [13]:
df['new_index'] = 0

In [14]:
df

   A  B         C  new_index
0  1  4      kiwi          0
1  2  5  vinivici          0
2  3  6      toto          0
3  4  7      alex          0

In [21]:
data = {"A":[1,2,3,4],
        "B":[4,5,6,7],
        "C":["kiwi","vinivici","toto","alex"]}
df1 = pd.DataFrame(df,index = [0,1,2,3])

In [22]:
df1

   A  B         C  new_index
0  1  4      kiwi          0
1  2  5  vinivici          0
2  3  6      toto          0
3  4  7      alex          0

In [20]:
df1.reindex([1,2,3,0])

   A  B         C
1  2  5  vinivici
2  3  6      toto
3  4  7      alex
0  1  4      kiwi

In [23]:
df['new_index'] = df['A'] + df['B']

In [25]:
df

   A  B         C  new_index
0  1  4      kiwi          5
1  2  5  vinivici          7
2  3  6      toto          9
3  4  7      alex         11

In [ ]:
# given a pandas dataframe df with a column values,writes a python function to calculate the mean ,median,mode and std of the values in the values columns

In [26]:
import pandas as pd

In [27]:
data = {"cars":['bmw','audi','mg','hyundai','kia'],
        "values":[5600000,450000,2300000,1200000,700000]
}

In [28]:
df = pd.DataFrame(data)

In [29]:
df

      cars   values
0      bmw  5600000
1     audi   450000
2       mg  2300000
3  hyundai  1200000
4      kia   700000

In [32]:
df["values"].mean()

2050000.0

In [33]:
df["values"].mode()

0     450000
1     700000
2    1200000
3    2300000
4    5600000
Name: values, dtype: int64

In [35]:
df["values"].median()

1200000.0

In [36]:
df["values"].std()

2107723.8908357993

In [ ]:
# you have a pandas dataframe df with columns 'A','B','C'. write a python function that selects all rows where the values in 'A' > 5 and 'B' <10.

In [37]:
import pandas as pd

In [39]:
data = {"A":[3,8,6,2,9],
      "B":[5,2,9,3,1],
      "C":[1,7,4,5,2]
}

In [51]:
df = pd.DataFrame(data)

In [52]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [53]:
df.iloc[[1,4]]

   A  B  C
1  8  2  7
4  9  1  2

In [ ]:
# how are dataframe.size() and dataframe.shape() different ?

In [ ]:
 # DATAFRAME.siz()
It will return the size of a pandas DataFrame, which is the exact number of data cells in your DataFrame.
This metric provides a high-level insight into the volume of data held by the DataFrame and is determined 
by multiplying the total number of rows by the total number of columns.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df.size

4

In [ ]:
# dataframe.shape() 
It returns a tuple containing the shape of the DataFrame.
The shape is the number of rows and columns of the DataFrame.

In [3]:
import pandas as pd

In [5]:
df = pd.DataFrame({'a':[34,5678,89], 'b':[980,345,234]})
df.shape

(3, 2)

In [ ]:
# which function of pandas do we use to read an excel file?

In [ ]:
We can use the pandas module read_excel() function to read the excel file data into a DataFrame object.
If you look at an excel sheet, it's a two-dimensional table.
The DataFrame object also represents a two-dimensional tabular data structure.
Files can be imported using a URL link or can be directly imported from the disk.
There are different parameters like io for path,sheet_name for specifying the name of the sheet, etc.
for reading the file.

In [ ]:
# given a pandas df with a column 'text', write a function to create a new column 'word_count'that contains the number of words in each row of column.

In [6]:
import pandas as pd

In [11]:
pd.set_option("display.max_colwidth", 500)
df = pd.DataFrame({"Text":["Data Science has been established as an important emergent scientific field and paradigm driving research evolution in such disciplines as statistics, computing science and intelligence science, and practical transformation in such domains as science, engineering, the public sector, business, social sci­ence, and lifestyle. The field encompasses the larger ar­eas of artificial intelligence, data analytics, machine learning, pattern recognition, natural language understanding, and big data manipulation. It also tackles related new sci­entific chal­lenges, ranging from data capture, creation, storage, retrieval, sharing, analysis, optimization, and vis­ualization, to integrative analysis across heterogeneous and interdependent complex resources for better decision-making, collaboration, and, ultimately, value creation. The International Journal of Data Science and Analytics (JDSA) brings together thought leaders, researchers, industry practitioners, and potential users of data science and analytics, to develop the field, discuss new trends and opportunities, exchange ideas and practices, and promote transdisciplinary and cross-domain collaborations.", "I use to learn data science", "my name is anshu sharma"]})

In [12]:
df

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  Text
0  Data Science has been established as an important emergent scientific field and paradigm driving research evolution in such disciplines as statistics, computing science and intelligence science, and practical transformation in such domains as science, engineering, the public sector, business, social sci­ence, and lifestyle. The field encompasses the larger ar­eas of artificial intelligence, data analytics, machine learning, pattern recognition, natural language understanding, and big data ma...
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          I use to learn data science
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              my name is anshu sharma

In [14]:
df['len']= df['Text'].apply(len)

In [15]:
df

,Text,len
0,"Data Science has been established as an important emergent scientific field and paradigm driving research evolution in such disciplines as statistics, computing science and intelligence science, and practical transformation in such domains as science, engineering, the public sector, business, social sci­ence, and lifestyle. The field encompasses the larger ar­eas of artificial intelligence, data analytics, machine learning, pattern recognition, natural language understanding, and big data ma...",1165
1,I use to learn data science,27
2,my name is anshu sharma,23

In [19]:
df['word_count'] = df['Text'].apply(lambda x: len(x.split()))

In [20]:
df

,Text,len,word_count
0,"Data Science has been established as an important emergent scientific field and paradigm driving research evolution in such disciplines as statistics, computing science and intelligence science, and practical transformation in such domains as science, engineering, the public sector, business, social sci­ence, and lifestyle. The field encompasses the larger ar­eas of artificial intelligence, data analytics, machine learning, pattern recognition, natural language understanding, and big data ma...",1165,144
1,I use to learn data science,27,6
2,my name is anshu sharma,23,5

In [ ]:
# create a new column 'weekday' in the df. the weekday column should contain the weekday name corresponding to each date in the date column.

In [21]:
df = pd.DataFrame({"date":['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05'],
                  "weekday":['sunday','monday','tuesday','wednesday','thursday']})

In [22]:
df

         date    weekday
0  2023-01-01     sunday
1  2023-01-02     monday
2  2023-01-03    tuesday
3  2023-01-04  wednesday
4  2023-01-05   thursday

In [ ]:
# to use the basic functions of pandas , what is the first and foremost necessary library that needs to be imported?

In [ ]:
installing and Getting Started with Pandas.
As Pandas is dependent on the NumPy library, we need to import this dependency.